{
    "config": {
        "asset_root": "https://assets.carvelli.io/personal"
    },
    "profile": {
        "firstname": "Giovanni",
        "fullname": "Giovanni Carvelli",
        "job_title": "Senior Software Engineer",
        "header": "Hello, I'm Gio.",
        "image": "https://gravatar.com/avatar/9c5c1a414e20e714b0ea466fa6617940/?s=400",
        "intro": "I am a Senior Software Engineer at Orchard. I love solving big problems!",
        "contact": "Want to get in touch? Contact me using one of the methods below!"
    },
    "profiles": [
        {
            "name": "Email",
            "icon": "fa-envelope-o",
            "link": "mailto:gio@carvelli.io",
            "handle": "gio@carvelli.io",
            "show": true,
            "show_in_contact": true
        },
        {
            "name": "LinkedIn",
            "icon": "fa-linkedin",
            "link": "https://linkedin.com/in/gcarvelli",
            "handle": "gcarvelli",
            "show": true,
            "show_in_contact": true
        },
        {
            "name": "Github",
            "icon": "fa-github",
            "link": "https://github.com/gcarvelli",
            "handle": "@gcarvelli",
            "show": true,
            "show_in_contact": false
        }
    ],
    "projects": [
        {
            "name": "Text Adventure",
            "image": "/projects/text-adventure.png",
            "link": "https://text-adventure.carvelli.io",
            "link_text": "Demo",
            "description": "A text-based game engine written in Typescript. Runs in-browser and in your terminal!",
            "show": true
        },
        {
            "name": "Which Exchange",
            "image": "/projects/whichexchange.png",
            "link": "https://kwikthinkers.carvelli.io/whichexchange",
            "link_text": "Demo",
            "description": "Guess which StackExchange site each question comes from! HackNJIT 2015 project.",
            "show": true
        },
        {
            "name": "Reddit Backgrounds",
            "image": "/projects/reddit-backgrounds.png",
            "link": "https://github.com/gcarvelli/reddit-backgrounds",
            "link_text": "Source",
            "description": "Scrape multiple subreddits for high resolution wallpapers. HackRPI 2015 project.",
            "show": true
        },
        {
            "name": "Spotify Backup",
            "image": "/projects/02.jpg",
            "link": "https://github.com/gcarvelli/spotify-backup",
            "link_text": "Source",
            "description": "Back up your Spotify playlist metadata via the Spotify API.",
            "show": true
        },
        {
            "name": "Geddit",
            "image": "/projects/geddit.png",
            "link": "https://github.com/gcarvelli/geddit",
            "link_text": "Source",
            "description": "Reddit clone written from scratch in Ruby on Rails.",
            "show": false
        },
        {
            "name": "House Explorer",
            "image": "/projects/house-explorer.png",
            "link": "https://github.com/gcarvelli/house-explorer",
            "link_text": "Source",
            "description": "A text-based game engine written in Python.",
            "show": false
        }
    ],
    "jobs": [
        {
            "company": "Orchard",
            "title": "Senior Software Engineer (Developer Experience)",
            "dates": "February 2020 - Present",
            "image": "/companies/orchard/orchard.svg",
            "bullets": [
                "As the single member of the DevX team, I scoped, designed, and completed several company-spanning projects including updating Python from 3.7 to 3.10, implementing Datadog logging and metrics, and building ARM-native Docker images in 20+ repositories.",
                "Maintained a suite of internal tools including test runners powered by an EC2 Autoscale Group, a Typescript-based wrapper around docker-compose that engineers use for local development, a library of CircleCI Orbs, a Superset instance to help identify test flakes, and Github/Slack bots running in Elastic Container Service.",
                "Served as a point-of-contact for any technical issues engineers had with their development environments, CI pipelines, and automated tests, as well as Data Engineering- and Infrastructure-related issues as those teams were let go or left.",
                "Assisted engineers as they migrated an application from bespoke architecture over to Cloud66, Orchard's standard production environment. This involved getting the application to run in a Kubernetes environment and merging their own secret store with our own.",
                "Created a test framework in Cypress and facilitated the migration of our flaky Protractor tests onto it.",
                "After a potential breach in CircleCI, I tracked down and rotated 175 secrets from projects across the organization. I owned the completion of this project, bringing our exposure to this breach down to 0."
            ],
            "show": true
        },
        {
            "company": "Orchard",
            "title": "Software Engineer (Product)",
            "dates": "February 2020 - Present",
            "image": "/companies/orchard/orchard.svg",
            "bullets": [
                "Built a wide-reaching Salesforce integration on top of Heroku Connect that empowered our Real Estate Agents to conduct their business entirely in Salesforce and Field Service Lightning.",
                "Isolated and abstracted Orchard's mission-critical Docusign integration into a single microservice capable of autofilling contracts, receiving webhooks, and triggering events in our real estate backend.",
                "Proctored more than 80 technical interviews for all engineering levels. Also created an interview for a new programming-heavy IT position and codified Orchard's first interviewer level-up process."
            ],
            "show": true
        },
        {
            "company": "Datto",
            "title": "Software Engineer",
            "dates": "July 2017 - February 2020",
            "image": "/companies/datto.png",
            "description": "Developed software powering remote Datto backup appliances, web management portals, and Datto's private storage cloud. Participated in several small, high-velocity task forces that converted Datto's fleet of 75,000 devices to an image-based upgrade strategy and build a scalable storage backend for Datto's Cloud Continuity backup agent.",
            "show": true
        },
        {
            "company": "Microsoft",
            "title": "Azure Machine Learning Development Intern",
            "dates": "Summer 2016",
            "image": "/companies/microsoft.png",
            "description": "Working as a member of a small development team under AzureML, optimized a polling-based communication system in AzureML's backend using notifications through Azure ServiceBus.",
            "show": true
        },
        {
            "company": "Datto",
            "title": "Cloud Development Intern",
            "dates": "Summer/Fall 2015",
            "image": "/companies/datto.png",
            "description": "Wrote and maintained code running on Datto's web portals, on-site devices, and storage nodes. Also worked on internal tooling for user account management.",
            "show": false
        },
        {
            "company": "Rochester Software Associates",
            "title": "C#/.NET Development Intern",
            "dates": "Summer/Fall 2014",
            "image": "/companies/rsa.png",
            "description": "Fixed bugs and developed new features for RSA's .NET-based suite of printer ticket transformation programs.",
            "show": false
        }
    ]
}
